# InvalidSketchForBuildingpad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..InvalidSketchForBuildingpad Property
BuiltInFailures..::..SketchFailures Class See Also
---
Pad sketch is invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSketchForBuildingpad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSketchForBuildingpad As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSketchForBuildingpad {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace